# ExtElemChangeBeamSectionRegistry Properties

---
The ExtElemChangeBeamSectionRegistry type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace